[
  {
    "path": "posts/2021-07-15-vast-challenge-2021-mc1/",
    "title": "VAST Challenge 2021 -- MC2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "YAN Ruiyun",
        "url": "https://www.linkedin.com/in/ruiyun-yan-b40208204/"
      }
    ],
    "date": "2021-07-15",
    "categories": [],
    "contents": "\r\nIntroduction\r\nGAStech is a company produces gas production in Abila, Kronos. Many of its employees have company cars which are approved for both personal and business use. Those who do not have company cars have the ability to check out company trucks for business use, but these trucks cannot be used for personal business.\r\nEmployees with company cars are happy to have these vehicles, because the company cars are generally much higher quality than the cars they would be able to afford otherwise. However, GAStech does not trust their employees. Without the employees’ knowledge, GAStech has installed geospatial tracking software in the company vehicles. The vehicles are tracked periodically as long as they are moving.\r\nHence, this article is trying to identify which purchases made by which employees and identify suspicious patterns of behavior to make recommendations for further investigation.\r\nAttention: Company cars can be used for personal and business use, but company trucks cannot be used for personal use\r\nDATA\r\n1. Data description\r\ncar-assignments.csv: A list of vehicle assignments by employee, which including Employee Last Name, Employee First Name, Car ID, Current Employment Type and Current Employment Title\r\nGeospatial folder: ESRI shapefiles of Abila and Kronos\r\ngps.csv: A file of vehicle tracking data, which including Timestamp, Car ID, Latitude and Longitude\r\nloyalty_data.csv: A file containing loyalty card transaction data, which including Timestamp, Location, Price and Loyalty Number\r\ncc_data.csv: A file containing credit and debit card transaction data, which including Timestamp, Location, Price and Last 4 digits of the credit or debit card number\r\nMC2-Tourist.jpg: A tourist map of Abila with locations of interest identified\r\n2. Importing data\r\nInstall and launch the packages used in this article.\r\n\r\n\r\npackages = c('raster','sf','tmap','clock','tidyverse')\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p,character.only = T)\r\n}\r\n\r\n\r\n\r\nImporting Abila shapefile into R.\r\n\r\n\r\nAbila_st <- st_read(dsn = \"data/Geospatial\", layer = \"Abila\")\r\n\r\n\r\nReading layer `Abila' from data source `C:\\RY-Yan\\R4VA\\_posts\\2021-07-15-vast-challenge-2021-mc1\\data\\Geospatial' using driver `ESRI Shapefile'\r\nSimple feature collection with 3290 features and 9 fields\r\nGeometry type: LINESTRING\r\nDimension:     XY\r\nBounding box:  xmin: 24.82401 ymin: 36.04502 xmax: 24.90997 ymax: 36.09492\r\nGeodetic CRS:  WGS 84\r\n\r\nImporting Aspatial data, vehicle assignment data, credit and debit card transaction data and loyalty card transaction data.\r\n\r\n\r\ngps <- read_csv(\"data/gps.csv\")\r\ncar <- read_csv(\"data/car-assignments.csv\")\r\ncd <- read_csv(\"data/cc_data.csv\")\r\nloyalty <- read_csv(\"data/loyalty_data.csv\")\r\n\r\n\r\n\r\nAttention: * Timestamp field is not in date-time format in Aspatial data file, credit and debit card transaction data file and loyalty card transaction data file. * id field in Aspatial data file should be in factor data type.\r\nHence, below codes are used to format the data:\r\n\r\n\r\ngps$Timestamp <- date_time_parse(gps$Timestamp,\r\n                                 zone = \"\",\r\n                                 format = \"%m/%d/%Y %H:%M:%S\")\r\ncd$timestamp <- date_time_parse(cd$timestamp,\r\n                                zone = \"\",\r\n                                format = \"%m/%d/%Y %H:%M\")\r\nloyalty$timestamp <- date_time_parse(loyalty$timestamp,\r\n                                     zone = \"\",\r\n                                     format = \"%m/%d/%Y\")\r\n\r\ngps$id <- as_factor(gps$id)\r\n\r\n\r\n\r\nExploration\r\n1. Anomalies of credit card and loyalty card data (Q1)\r\n\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies? Please limit your answer to 8 images and 300 words.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-17T00:38:47+08:00",
    "input_file": "vast-challenge-2021-mc1.utf8.md"
  },
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover #2",
    "description": "DataViz Makeover 2 for ISSS608: Visual Analytics.",
    "author": [
      {
        "name": "YAN Ruiyun",
        "url": "https://www.linkedin.com/in/ruiyun-yan-b40208204/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1. Original visualization Evaluation\r\n1.1 Clarity\r\nTop net exporter/importer is the trading partner with largest net export/import value. In this case, both x-axis and y-axis are showing the export and import values, so for the reader who know little about economics, they may confuse that why Hong Kong instead of Mainland China which partner had the largest export value, was the top net exporter.\r\nThe centre point (white circle) is an important indicator because according to this point, readers can recognize the relation between import and export value. In this case, some bubbles overlay each other so that it is inconvenient to compare the size of the import and export values by seeing the position of white circle.\r\nUnclear net importers/exporters label. This visualisation doesn’t clarify that whether white point or bubble falls into the “Net importers/exporters” section means that the trading partner is “Net importers/exporters”.\r\n\r\n1.2 Aesthetics\r\nUnnecessary note since the visualization do not show any information about it, and the dashboard header is missing.\r\n\r\nTooltips are confusing. The reader cannot directly understand what these values represent and there is not clarification in note.\r\n\r\nImproper formatting of both x-axis and y-axis. The units comprising SGD were missing\r\n2. Proposed Design\r\n2.1 Sketch\r\nThe proposed design is as follow.\r\n\r\n2.2 Advantages of proposed design\r\nUse blue and red to show the net importer and net exporter which is easily recognized.\r\nUse percentile instead of actual value because EU has larger export/import values than any other trading partners.\r\nAn Net Export chart will be created, to see the difference in values which perhaps the earlier visualization didn’t show.\r\nAnimation are used to emotionally engaging, engendering increased interest or enjoyment, and facilitates object constancy for changing objects.\r\n3. Data visualization steps\r\nThe raw data is in .xlsx format.\r\nIt contains 2 sheets:\r\nT1: Merchandise Imports by Region/Market, Monthly\r\nT2: Merchandise Exports by Region/Market, Monthly\r\nThings to Note:\r\nData starts at row 6\r\nTrading partners and date need to be filtered out\r\nData needs to be transposed\r\n3.1 Data preparation\r\nFirst, launch the Tableau Desktop software.\r\nImport the Data.\r\nAs discussed previously, since the data only begins at row 6, we will check the Data Interpreter before dragging tables into the workspace.\r\n\r\nDrag T1 into the workspace.\r\n\r\nSince, we only require the 10 trading partners, a filter will be applied. The sequence steps are highlighted in the following:\r\nClick on the Add|Filter button and then Add.\r\n\r\nSelect Variables and Click OK.\r\n\r\nSelect all the 10 trading partners (Mainland China, Malaysia, Hong Kong, Taiwan, United States, Japan, EU, Indonesia, Republic of Korea and Thailand).\r\n\r\nWe will see the filter added as shown below. Register the changes by clicking OK.\r\n\r\nPivot the table.Select all columns and click the black triangle of the last column on the right\r\n\r\nRename columns\r\nSelect the Abc icon and right click and select Date to change the format of the column.\r\n\r\nRight click on the column one-by-one and select Rename. Rename the respective columns to Date, Import Value and Name of trading partner\r\n\r\nSince we require years from 2011 to 2020, we will add another filter.\r\nThe steps are shown below:\r\n\r\n\r\n\r\n\r\nSave the file as Import.csv\r\n\r\nRepeat the steps 2~7 for T2 and export the data as Export.csv\r\nOpen a new session of Tableau and drag the newly created Import.csv.\r\nDrag the Import.csv node into the workspace.\r\n\r\nNow, we will merge the two .csv files on Date & Name of trading partner. Double click on Import.csv in the workspace and then drag Export.csv in.\r\nNext, click on the Venn Diagram icon add Date.\r\n\r\nThen, we hide the two duplicate columns\r\nRight click and select Hide\r\n\r\nCreate aliases for trading partner data\r\nRight click on the Name of trading partner column and select Aliases.\r\nFor each of the partner, edit the name and click ok.\r\n\r\nSince for EU unit of measurement is Million dollar, we need to calculate the import/export value.\r\n\r\n3.2 Data visualization\r\nFor the main chart, drag ‘Import Value’ to ‘Rows’ and ‘Export Value’ to ’Columns shelves.\r\n\r\nAs EU has larger export/import than any other trading partners, we will change use percentile instead of actual value in this chart.\r\nClick the triangle –> Quick Table Calculation –> Percentile\r\n\r\nClick the triangle again –> Compute Using –> Name of trading partner\r\n\r\nCreate a new Calculated Field to show the transaction amount\r\n\r\nDrag ‘Export-Import’ into Color, so the color will show whether a trading partner is a Net Importer or a Net Exporter. Drag ‘Export+Import’ into Size.\r\n\r\nColor setting & Reference line\r\n\r\n\r\nAdd the reference line both for y-axis and x-axis\r\n\r\n\r\nDrag ‘Date’ into Pages, select Year.\r\n\r\nAdd two calculated field and drag them into tooltip.\r\n\r\n\r\n\r\nClick Tooltip and edit it.\r\n\r\nFor chart 2, create a new worksheet and name it “Yearly Trade’. Drag ‘Name of trading partner’ and ‘Date’ to ‘Columns’ and ‘Export Value’ to ‘Rows’ shelves. Sort ‘Name of trading partner’ by descending sum of ‘Export Value’. Since EU has a large export/import value, we would build a chart (chart3) for it separately.\r\n\r\n\r\nCreate a new calculated field: ‘Export-Import’.\r\n\r\nAdding Export-Import Drag and drop Export-Import twice on to the Rows bar.\r\n\r\nNext, we will click on the lower y-axis and select Dual Axis and Synchronize Axis.\r\n\r\n Now, we will change the chart into a bar chart. Under the Marks card, select SUM(Export-Import) and select from the drop down, Bar. Then drag the Export-Import variable into the Color box and reduce the opacity.\r\n\r\nChanging the color, adjust the setting like below:\r\n\r\nCreate a dashboard, drag above two charts into it.\r\nThen add Animation function.\r\n\r\n\r\nThen synchronize the animation.\r\n\r\n4.2 Main observations\r\nEU was always the largest net importer from 2011-2020, but it’s net export increase rapidly in 2020 which means import from EU had decreased that time. This coincided with the COVID-19 happened.\r\nTaiwan and EU were the major net importer of Singapore because from 2011 to 2020 the import value was always larger than the export value.\r\nOverall, Singapore is trying to produce own products and export to other countries since more trading partner are becoming net exporters.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T23:37:18+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-1/",
    "title": "DataViz Makeover #1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics.",
    "author": [
      {
        "name": "YAN Ruiyun",
        "url": "https://www.linkedin.com/in/ruiyun-yan-b40208204/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1. Original visualization Evaluation\r\n1.1 Clarity\r\nThere is duplication of each chart. Area chart usually used to show a response to summarized by categories and used to represent cumulated totals using numbers or percentages (stacked area charts in this case) over time. For the chart, there is duplication of import and export which is difficult to see the trend.\r\nTime period of each country are not clear enough, Japan only has 2020 while others have 2019~2021.\r\nThe Y-axis of each country is not the same, as such, the difference in scale is not conveyed properly. It is hard to compare the different import and export trade across different country or even within the same country.\r\n1.2 Aesthetics\r\nIt is not necessary to use two Y-axes to represent export and import. It will confuse readers. In addition, there is no marker to identify which country’s currency is used to measure the exports and imports.\r\nThe title of the graph shows these six countries are the top trade countries. The subtitles of the graphs do not convey the intent of the graphs well. In this case, the graph is trying to show the change in merchandise trade of six country during 2019 and 2020, and the subtitles “Month of Period” mention that the graphs are using the monthly data while the X-axis only show yearly marker. Hence, the subtitles are not clear.\r\nThere is poor use of colors in the chart. The fill color is not particularly useful as it does not seem to serve any purpose, especially for some charts which have lots of duplication.\r\n2. Proposed Design\r\n2.1 Sketch\r\nThe proposed design is as follow.\r\n\r\n2.2 Advantages of proposed design\r\nMore clear title and subtitle are used to explain key words and definitions in the graph.\r\nY-axis are changed to same unit of measurement to enable the reader to read and compare imports value, exports value and net exports value across different month more easily.\r\nNew measure value: net export value is used to show the merchandise trade of each country clearly.\r\nAdd a bar chart to show net value, color (green and red) is used to bring attention negative or positive net exports value.\r\nAnnotations are used to emphasize key observations. Within the annotations, ranking of net exports value is added to show the rank each month between countries.\r\n3. Data visualization steps\r\n3.1 Data preparation\r\nCheck “Clean with Data Interpreter” to automatically identify the form. \r\nSelect useless months (months between 1976 ~ 2018 and after 2021) and hide. \r\nUse Tableau to pivot the data in sheet, with measure values in columns and variables (countries) in rows. \r\nView the data in Tableau. \r\nExport the data.\r\n\r\nRepeat steps 1 – 6 for exports. Merge the exported files using Microsoft Excel and select observations from six countries.\r\nImport the cleaned dataset into Tableau. \r\n3.2 Data visualization\r\nAdd “Month” to Columns tab and “Country”, “Measure Values” and “Net Export” to Rows tab.\r\n\r\nRemove other measure values only keep imports and exports. \r\nRight click on the bottom Y-axis and select dual axis chart to make import values and export values show in the same view.\r\n\r\nRight click on the right Y-axis, select Synchronize Axis and deselect Show Header to let the Y-axis of each country under the same measurement.\r\n\r\nDrag Net Exports to Color tab and change panel from Automatic to Bar. \r\nRename the title and the measure names. \r\nShow the value of each country’s imports and exports in January 2019 and December 2020 to let readers see the change easily. \r\nRight click the Net Export tab on the right and click edit colors. Set stepped color in 2 and choose 2 colors. For red, it means represent imports is greater than exports and green represent the opposite situation.\r\n\r\nCreate three Calculated Fields. \r\n\r\n\r\nDrag three Calculated Fields into Tooltip and edit Tooltip. \r\nCreate a new dashboard and drag the Sheet 1 from left to the right. \r\n\r\n4. Final visualization\r\n4.1 Snapshot of dashboard\r\n\r\n4.2 Main observations\r\nOverall, export is trending upwards across all countries/regions except Japan between 2019 and 2020. For import, three countries/regions (Hong Kong, Tai Wan and Malaysia) increase while other three (Mainland China, The U.S. and Japan) decrease.\r\nFor net exports value, there was negative as well as positive in Japan, Malaysia, the U.S. and Mainland China while Hong Kong only had negative values and Tai Wan only had positive values.\r\nFor the countries which had both negative and positive net exports value, most of the consecutive negative net exports had been since April 2020. This may be potentially because of COVID-19.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T19:59:01+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Ruiyun's Blog",
    "description": "This blog consists of a collection of R assignments, projects and . We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "YAN Ruiyun",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T18:04:58+08:00",
    "input_file": {}
  }
]
